chubachi.org
#+TITLE: PBLにおける課題
#+AUTHOR: 産業技術大学院大学 \linebreak 中鉢 欣秀
#+DATE: 2014-09-29
#+BEAMER_THEME: Madrid
#+OPTIONS: toc:nil
#+OPTIONS: H:1
#+OPTIONS: ^:nil
#+COLUMNS: %45ITEM %10BEAMER_ENV(Env) %10BEAMER_ACT(Act) %4BEAMER_COL(Col) %8BEAMER_OPT(Opt)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 0.0 :ETC
#+LaTeX_CLASS_OPTIONS: [t]

* はじめに
** PBLにおける課題
   - テーマ設定に関する話題
** 振り返り
   - ここ数年のテーマ設定について振り返り，
     今後のテーマを探る

* 2011年度テーマ
** タイトル
   ソフトウェア開発プロジェクトのマネージャ育成メソッド
** 内容
   - PMBOKを実施するための最適なツール技法を探る
   - Redmine，MS Project Server
   - プロジェクトマネジメントガイドブックを作成
   - ベトナム国家大学UET，SFCの学生とのPBLをマネジメント
     - 合計5つのサブプロジェクト

* 2012年度テーマ
** タイトル
   ソフトウェア開発プロジェクトのマネジメント方法論
** 内容
    - アジャイル開発プロセスのマネジメント方法論
    - コーチングや教材作成
    - アジャイル開発の専門家との連携
    - ベトナム国家大学UET，SFCの学生とのPBLを実施

* 2013年度テーマ
** タイトル
   ソフトウェア開発プロジェクトのマネジメント方法論
** 内容
    - Scrumをマスターして実践する
    - 小規模・短納期のソフトウエア開発
    - 自己組織化・ヒューリステックな体得
  - ベトナムとのプロジェクトはenPiTで実施

* 開発のプロセスから「場」へ
** PMBOKからScrumへ
  - 当初はPMBOK型のプロセスを参考に，
    少人数・短納期型の開発プロセスを探求することをテーマとしていた
  - 2011年ころから，Scrumを指導するアジャイルコーチの方々と接するようになり
    刺激を受けた
** プロセスから場へ
  - アジャイル型開発は，明確なプロセスがあるわけではない
    - Scrumには，若干のプロセスの規定がある
  - PBLでは，定められたプロセスに従うのではなく，
    学生が自ら良いやり方を見つける「場」であるべき

* グローバルPBLの反省
** 課題
  - 日本側学生の英語力の問題
  - これといった成果物が出ないわりには手間がかかる
** 状況の変化
  - アウトソーシング型の国際プロジェクトはおそらく，
    魅力がなくなってきている
  - 「グローバルなマーケット」に通用する技術者育成が重要

* 2014年度テーマ
** タイトル
   Global and Agile Software Development in the Ruby Community
** 内容
   - Rubyのコミュニティに参加し，グローバルに活躍できるソフトウエア開発者
     を目指す
   - Rubyのエコシステムや，クラウド型のツールを活用したソフトウエア開発
   - 前半（1,2Q）は一人アジャイル開発を実施
   - 後半（3,4Q）はチームによるアジャイル開発

* 2014年度の現状について
** 進捗について
  - enPiTに参加した学生が多かったこともあり，ツールを使った開発を取得する
    ための期間が予定よりも短くて済んだ
  - Rubyのコーディングについては，コードのレビューを徹底して指導できた
** 成果物への期待
  - 予定を前倒しして，チームによる開発に進むことができた
  - mrubyで自己記述できるテキストエディタの開発
    - うまくいけばおそらく画期的

* enPiTのグローバルコースについて
  - 昨年度は，ベトナム・ブルネイの2カ国，今年はニュージーランドが追加
    - 私はベトナムを担当
    - 全体のアレンジは土屋先生が担当してくれたので，自分の負荷は減った
  - 今回初めて，遠隔でミーティングをしている時にベトナムを訪問
    - ネットワーク環境，TV会議用マイクがないことによる問題を目の当たりにした
  - 海外の学生が「PO」になっていることが特徴
    - グローバルに通用するサービスを企画
    - 日本メンバーが実装し，海外メンバーがレビュー
    - アウトソース型とは全く逆のアプローチ
* enPiTのビジネスアプリケーション演習
  - Scrumを実践するための道具
    - Rubyとエコシステム
    - クラウド（GitHub/Travis CI/Heroku）
  - 開発のサイクルをひと通り回すために最低限の知識を，
    全体観を持って身につけてもらう
  - 実施にあたって工夫
    - 演習用仮想化環境を配布
    - 準備作業をビデオにて解説
    - 非常にスムーズに演習が実施できた
  - 飲み会で感想を聞いた範囲では，好評であった
* おわりに
   - 開発の最前線の技術の変化は激しく，キャッチアップが必要
     - 技術動向を踏まえ，引き続きテーマを見直していく
   - 開発方法論については，アジャイルとクラウド型開発環境が
     現状では妥当なテーマ
   - 「どうつくるか」から「何を作るか」に比重をシフトしていきたい
   - 「マーケットのグローバル化」に対応できる技術者育成を
     おこなっていく
   - enPiT科目の今後の動向もふまえたい
