chubachi.tex
% Created 2014-09-29 月 13:15
\documentclass[t]{beamer}
\usepackage{zxjatype}
\usepackage[ipa]{zxjafont}
\setbeamertemplate{navigation symbols}{}
\hypersetup{colorlinks,linkcolor=,urlcolor=gray}
\AtBeginSection[]
{
  \begin{frame}<beamer>{Outline}
  \tableofcontents[currentsection,currentsubsection]
  \end{frame}
}
\setbeamertemplate{navigation symbols}{}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\usetheme{Madrid}
\author{産業技術大学院大学 \linebreak 中鉢 欣秀}
\date{2014-09-29}
\title{PBLにおける課題}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.2.6)}}
\begin{document}

\maketitle

\begin{frame}[label=sec-1]{はじめに}
\begin{block}{PBLにおける課題}
\begin{itemize}
\item テーマ設定に関する話題
\end{itemize}
\end{block}
\begin{block}{振り返り}
\begin{itemize}
\item ここ数年のテーマ設定について振り返り，
今後のテーマを探る
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label=sec-2]{2011年度テーマ}
\begin{block}{タイトル}
ソフトウェア開発プロジェクトのマネージャ育成メソッド
\end{block}
\begin{block}{内容}
\begin{itemize}
\item PMBOKを実施するための最適なツール技法を探る
\item Redmine，MS Project Server
\item プロジェクトマネジメントガイドブックを作成
\item ベトナム国家大学UET，SFCの学生とのPBLをマネジメント
\begin{itemize}
\item 合計5つのサブプロジェクト
\end{itemize}
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label=sec-3]{2012年度テーマ}
\begin{block}{タイトル}
ソフトウェア開発プロジェクトのマネジメント方法論
\end{block}
\begin{block}{内容}
\begin{itemize}
\item アジャイル開発プロセスのマネジメント方法論
\item コーチングや教材作成
\item アジャイル開発の専門家との連携
\item ベトナム国家大学UET，SFCの学生とのPBLを実施
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label=sec-4]{2013年度テーマ}
\begin{block}{タイトル}
ソフトウェア開発プロジェクトのマネジメント方法論
\end{block}
\begin{block}{内容}
\begin{itemize}
\item Scrumをマスターして実践する
\item 小規模・短納期のソフトウエア開発
\item 自己組織化・ヒューリステックな体得
\item ベトナムとのプロジェクトはenPiTで実施
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label=sec-5]{開発のプロセスから「場」へ}
\begin{block}{PMBOKからScrumへ}
\begin{itemize}
\item 当初はPMBOK型のプロセスを参考に，
少人数・短納期型の開発プロセスを探求することをテーマとしていた
\item 2011年ころから，Scrumを指導するアジャイルコーチの方々と接するようになり
刺激を受けた
\end{itemize}
\end{block}
\begin{block}{プロセスから場へ}
\begin{itemize}
\item アジャイル型開発は，明確なプロセスがあるわけではない
\begin{itemize}
\item Scrumには，若干のプロセスの規定がある
\end{itemize}
\item PBLでは，定められたプロセスに従うのではなく，
学生が自ら良いやり方を見つける「場」であるべき
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label=sec-6]{グローバルPBLの反省}
\begin{block}{課題}
\begin{itemize}
\item 日本側学生の英語力の問題
\item これといった成果物が出ないわりには手間がかかる
\end{itemize}
\end{block}
\begin{block}{状況の変化}
\begin{itemize}
\item アウトソーシング型の国際プロジェクトはおそらく，
魅力がなくなってきている
\item 「グローバルなマーケット」に通用する技術者育成が重要
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label=sec-7]{2014年度テーマ}
\begin{block}{タイトル}
Global and Agile Software Development in the Ruby Community
\end{block}
\begin{block}{内容}
\begin{itemize}
\item Rubyのコミュニティに参加し，グローバルに活躍できるソフトウエア開発者
を目指す
\item Rubyのエコシステムや，クラウド型のツールを活用したソフトウエア開発
\item 前半（1,2Q）は一人アジャイル開発を実施
\item 後半（3,4Q）はチームによるアジャイル開発
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label=sec-8]{2014年度の現状について}
\begin{block}{進捗について}
\begin{itemize}
\item enPiTに参加した学生が多かったこともあり，ツールを使った開発を取得する
ための期間が予定よりも短くて済んだ
\item Rubyのコーディングについては，コードのレビューを徹底して指導できた
\end{itemize}
\end{block}
\begin{block}{成果物への期待}
\begin{itemize}
\item 予定を前倒しして，チームによる開発に進むことができた
\item mrubyで自己記述できるテキストエディタの開発
\begin{itemize}
\item うまくいけばおそらく画期的
\end{itemize}
\end{itemize}
\end{block}
\end{frame}

\begin{frame}[label=sec-9]{enPiTのグローバルコースについて}
\begin{itemize}
\item 昨年度は，ベトナム・ブルネイの2カ国，今年はニュージーランドが追加
\begin{itemize}
\item 私はベトナムを担当
\item 全体のアレンジは土屋先生が担当してくれたので，自分の負荷は減った
\end{itemize}
\item 今回初めて，遠隔でミーティングをしている時にベトナムを訪問
\begin{itemize}
\item ネットワーク環境，TV会議用マイクがないことによる問題を目の当たりにした
\end{itemize}
\item 海外の学生が「PO」になっていることが特徴
\begin{itemize}
\item グローバルに通用するサービスを企画
\item 日本メンバーが実装し，海外メンバーがレビュー
\item アウトソース型とは全く逆のアプローチ
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[label=sec-10]{enPiTのビジネスアプリケーション演習}
\begin{itemize}
\item Scrumを実践するための道具
\begin{itemize}
\item Rubyとエコシステム
\item クラウド（GitHub/Travis CI/Heroku）
\end{itemize}
\item 開発のサイクルをひと通り回すために最低限の知識を，
全体観を持って身につけてもらう
\item 実施にあたって工夫
\begin{itemize}
\item 演習用仮想化環境を配布
\item 準備作業をビデオにて解説
\item 非常にスムーズに演習が実施できた
\end{itemize}
\item 飲み会で感想を聞いた範囲では，好評であった
\end{itemize}
\end{frame}
\begin{frame}[label=sec-11]{おわりに}
\begin{itemize}
\item 開発の最前線の技術の変化は激しく，キャッチアップが必要
\begin{itemize}
\item 技術動向を踏まえ，引き続きテーマを見直していく
\end{itemize}
\item 開発方法論については，アジャイルとクラウド型開発環境が
現状では妥当なテーマ
\item 「どうつくるか」から「何を作るか」に比重をシフトしていきたい
\item 「マーケットのグローバル化」に対応できる技術者育成を
おこなっていく
\item enPiT科目の今後の動向もふまえたい
\end{itemize}
\end{frame}
% Emacs 24.3.1 (Org mode 8.2.6)
\end{document}